Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/НастройкиРаспределения/НастройкиРаспределения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиРаспределения</name>
  <resources>
    <name>Настройка</name>
    <type>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазрезУчета</name>
    <type>
      <types>EnumRef.РазрезыУчета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/НастройкиРаспределения/Forms/СохранитьНастройку/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Подразделение = Параметры.Подразделение;
	Документ = Параметры.Документ;
	СтатьяРасходов = Параметры.СтатьяРасходов;
	Если Параметры.УправленческийУчет
		И Не Параметры.РегламентированныйУчет Тогда
		РазрезУчета = Перечисления.РазрезыУчета.Управленческий;
	ИначеЕсли Не Параметры.УправленческийУчет
		И Параметры.РегламентированныйУчет Тогда
		РазрезУчета = Перечисления.РазрезыУчета.Регламентированный;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьНастройку();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройку()
	
	МенеджерЗаписи = РегистрыСведений.НастройкиРаспределения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СтатьяРасходов = СтатьяРасходов;
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.РазрезУчета = РазрезУчета;
	
	Если ИспользоватьДляПодразделения > 0 Тогда
		МенеджерЗаписи.Подразделение = Подразделение;
	КонецЕсли;
	
	МенеджерЗаписи.Настройка = Документ;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
